Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: ཤིན་ཏུ་བཟོད་ཅིང་ཕ་རོལ་གནོད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as being extremely tolerant but overpowering enemies.

source: མཐུ་ཅན་ལ་གཞན་གྱིས་གནོད་པ་བྱས་ཀྱང་དེ་ལ་དང་དུ་ལེན་པ་ནི་དཔེར་ན་རྒྱལ་པོའི་བུ་ཀུ་ཤའི་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Diligence ripens as freely accepting the harms inflicted by others, as exemplified by Prince Kuśa.

source: སྤྱོད་པ་ཐོས་ཀྱང་དང་དུ་ལེན་པ་ནི་དཔེར་ན་མིག་བཟངས་བཙུན་མོ་དམ་པས་ཡི་ཆད་ཀྱང་དང་དུ་ལེན་པ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as wholehearted acceptance even though one hears rebuke, as exemplified by the noble queen Sunetrā, who became distressed but took it upon herself.

source: སྲེད་པས་མི་འཕྲོགས་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as diligence that cannot be swayed by craving.

source: བསམ་གཏན་ཐམས་ཅད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as universal concentration.

source: སྐྱེ་བ་ལས་འདས་ཀྱང་རྗེས་སུ་འཇུག་པའི་ཤེས་རབ་ནི་དཔེར་ན་བྲམ་ཟེའི་བུ་བླ་མའི་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as insight that engages despite having gone beyond birth, as exemplified by the brahmin youth Guru.

source: འདི་དག་ནི་བརྩོན་འགྲུས་ཀྱི་སྟོབས་དང་མཚུངས་པར་ལྡན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections associated with the power of diligence.

source: དེ་ལ་དྲན་པའི་སྟོབས་དང་མཚུངས་པར་ལྡན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections associated with the power of mindfulness?

source: ལྷ་ཡུལ་དག་དྲན་པ་རྒྱུན་མི་འཆད་ཀྱང་ལྷའི་འདོད་པ་དག་ལ་ལྷག་པར་ཆགས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as continuous recollection of the heavens but without having any attachment to them.

source: ལྷའི་བུ་མོ་དག་གི་ཉེས་དམིགས་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as seeing the flaws of the goddesses.

source: གཞལ་མེད་ཁང་དག་ལ་མངོན་པར་དགའ་བ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as having no fondness for the palaces.

source: ལྷར་གྱུར་ནས་ཐར་པ་ལ་རེ་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as hoping for liberation even if one is born a god.

source: ལྷའི་འཁོར་གྱི་འདུ་འཛི་ལ་མི་གནས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as not dwelling on the sensual activities of the divine retinue.

source: ལྷ་རྣམས་ཆོས་སྟོན་པ་ལ་མངོན་པར་ཆགས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as teaching the Dharma to the gods without any attachments.

source: འདི་དག་ནི་དྲན་པའི་སྟོབས་དང་མཚུངས་པར་ལྡན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections associated with the power of mindfulness.

source: དེ་ལ་ཏིང་ངེ་འཛིན་གྱི་སྟོབས་དང་མཚུངས་པར་ལྡན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “Which are the six perfections associated with the power of absorption?

source: དངོས་པོ་ཡོངས་སུ་བཏང་ནས་ཏིང་ངེ་འཛིན་ལ་དགའ་བ་ནི་དཔེར་ན་རྒྱལ་པོ་ལྷ་ཆེན་པོས་རྒྱལ་སྲིད་བོར་ཏེ་རབ་ཏུ་བྱུང་བའི་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as taking delight in absorption after having relinquished all possessions, just like King Mahādeva, who relinquished his realm to become a monk.

source: སེམས་ཀྱི་སྦྱོར་བ་ལུས་དང་ངག་གི་ལྷག་མ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as mental engagement being superior to those of body and speech.

source: ལེགས་པར་བྱེད་པའི་ལས་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as engagement in wholesome actions.

source: ཆོས་ཇི་ལྟ་བ་བཞིན་དུ་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as correct understanding of the Dharma.

source: སྟོང་པའི་ཆོས་ལ་ལྷག་པར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as the clear perception of empty phenomena.

source: འཇིག་རྟེན་པའི་ཆོས་ཀྱིས་མ་གཏུགས་པ་གང་ཡིན་པ་དེ་ནི་དཔེར་ན་རྫ་མཁན་གྱི་ཁྱིམ་དུ་སྨན་ཆེན་ལྟ་བུས་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as being unblemished by mundane phenomena, just as when a great medicine is found in the home of a potter.

source: འདི་དག་ནི་ཏིང་ངེ་འཛིན་གྱི་སྟོབས་དང་མཚུངས་པར་ལྡན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections associated with the power of absorption.

source: དེ་ལ་ཤེས་རབ་ཀྱི་སྟོབས་དང་མཚུངས་པར་ལྡན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections associated with the power of insight?

source: མགོ་ཡོངས་སུ་བཏང་ཡང་སྒྱིད་མ་ལུག་པ་ནི་དཔེར་ན་ཡུལ་ཀ་ཤིའི་རྒྱལ་པོ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as not feeling discouraged even by giving away one’s own head, as exemplified by the King of Kāśī.

source: གཞན་ལ་བརྩེ་བའི་ཕྱིར་བདག་ཉིད་ཡོངས་སུ་གཏོང་བ་ནི་དཔེར་ན་འགྲོན་པོའི་དོན་དུ་བྱང་ཆུབ་སེམས་དཔས་གནོད་སྦྱིན་ལ་བདག་ཉིད་བཏང་སྟེམིའི་གཏོར་མ་བདེ་བར་བྱིན་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as giving oneself out of love for others, as, for example, when the Bodhisattva offered himself to the yakṣa, thus happily offering himself as a human sacrifice.

source: མུ་ཏིག་གི་ཕྱིར་རྒྱ་མཚོར་ལན་གསུམ་དུ་འགྲོ་ན་ནི་ཏས་ཕུག་ཀྱང་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as the patience demonstrated by traveling to sea three times in pursuit of pearls despite a tremendous challenge.

source: ལེགས་སྡུག་སྡུག་བསྔལ་ཐོབ་ནས་སྦྱིན་པ་མི་སྦྱིན་ཞིང་སེམས་ཞུམ་པས་ལན་བདུན་དུ་རྒྱ་མཚོ་ཆེན་པོར་ཞུགས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as being unaffected by any experience of happiness or suffering, and thus being able to cross the ocean seven times without becoming hesitant in one’s commitment to generosity.

source: སྐྱེ་བ་རྣམས་སུ་ཇི་ལྟར་འདོད་པ་བཞིན་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as the perfection of concentration according to one’s wishes throughout all one’s lives.

source: སྟོན་པ་བཏང་བ་ན་བྱང་ཆུབ་སེམས་དཔའ་གསོལ་བ་འདེབས་ཀྱིས་ཚུལ་ལེགས་པར་ཆོམ་རྐུན་གཡག་པོ་ཁོང་དུ་ཆུད་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens in the way that the Bodhisattva’s supplication instilled proper understanding in the thief attendants during the feast.

source: འདི་དག་ནི་ཤེས་རབ་ཀྱི་སྟོབས་དང་མཚུངས་པར་ལྡན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections associated with the power of insight.

source: དེ་ལ་དྲན་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the mindfulness factor of awakening?

source: མི་དགེ་བ་སྤོང་བའི་དྲན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as mindfulness of relinquishing unvirtuous phenomena.

source: ཡིད་དུ་འོང་བའི་འདུ་ཤེས་ལ་གནས་པའི་དྲན་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as mindfulness of adhering to delightful conceptions.

source: ཆོས་རྣམས་ཀྱི་བརྡའི་དྲན་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as mindfulness of the signs of the Dharma teachings.

source: བརྩོན་འགྲུས་ཆུད་མི་ཟ་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as diligence not being wasted.

source: སྟོབས་རྣམས་རྣམ་པར་བསྒོམ་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as cultivation of the powers.

source: དྲན་པ་དང་ཐར་པའི་སྟོབས་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ། འདི་དག་ནི་དྲན་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Insight ripens as the power of mindfulness and liberation. Such are the six perfections of the mindfulness factor of awakening.

source: དེ་ལ་ཆོས་རྣམ་པར་འབྱེད་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the factor of awakening that discerns phenomena?

source: ཆོས་རྣམ་པར་འབྱེད་པས་སྐྱོན་སྤོང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as relinquishing of flaws through the discerning of phenomena.

source: ཆོས་རྣམ་པར་འབྱེད་པས་ཐར་པ་དང་འཐུན་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as harmonizing with liberation through the discerning of phenomena.

source: མཐའ་གཉིས་ཡོངས་སུ་སྤོང་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as relinquishing the two extremes.

source: ཆོས་རྣམ་པར་འབྱེད་པ་རྒྱུན་མི་འཆད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as continuously discerning phenomena.

source: ཆོས་རྣམ་པར་འབྱེད་པ་སྒྲོ་མི་འདོགས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as discerning phenomena without superimposing anything.

source: འདི་དག་ཐམས་ཅད་ལ་མི་འཛིན་པར་བསྒོམ་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as the absence of grasping any of these factors.

source: འདི་དག་ནི་ཆོས་རྣམ་པར་འབྱེད་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ །
en: Such are the six perfections of the factor of awakening that discerns phenomena.

source: དེ་ལ་བརྩོན་འགྲུས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the diligence factor of awakening?

source: རྟོགས་ནས་རྗེས་སུ་ཆགས་པའི་དངོས་པོ་སྤོང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as realization whereby one gives up objects of attachment.

source: བརྩོན་འགྲུས་བླ་ན་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as unsurpassable diligence.

source: བརྩོན་འགྲུས་ལ་མངོན་པར་ཞེན་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as the absence of attachment to diligence.

source: བདག་དང་སེམས་ཅན་དང་། སྲོག་དང་། གསོ་བ་བསལ་བ་ལ་མི་གནས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as not adhering to a self, a sentient being, a life force, or a person.

source: ཀུན་ཏུ་སྦྱོར་བ་རྣམས་ལ་ཇི་མི་མཇེད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as not accepting any of the fetters.

source: བདག་ཉིད་དཔྱོད་ཅིང་བཟོ་ཐམས་ཅད་བསྒྲུབ་ལ་ས་བདུན་པའི་ཤེས་པ་ཡོངས་སུ་མ་གཏུགས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as discerning oneself and mastering all crafts, thus attaining inexhaustible knowledge of the seventh spiritual level.

source: འདི་དག་ནི་བརྩོན་འགྲུས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the diligence factor of awakening.

source: དེ་ལ་ཤིན་ཏུ་སྦྱངས་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the ease factor of awakening?

source: ལུས་ཤིན་ཏུ་སྦྱངས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as physical ease.

source: སེམས་ཤིན་ཏུ་སྦྱངས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as mental ease.

source: འཁོར་བ་ལ་བརྐམ་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as a lack of craving for saṃsāra.

source: ཤིན་ཏུ་སྦྱངས་པ་རྒྱུན་མི་འཆད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as continuous ease.

source: ཤིན་ཏུ་སྦྱངས་པ་སྒོམ་པའི་སོ་སོར་བརྟགས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as analysis of the cultivation of ease.

source: ཤིན་ཏུ་སྦྱངས་པ་ཡང་དག་པ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as true understanding of ease.

source: འདི་དག་ནི་ཤིན་ཏུ་སྦྱངས་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the ease factor of awakening.

source: དེ་ལ་ཏིང་ངེ་འཛིན་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the absorption factor of awakening?

source: ཏིང་ངེ་འཛིན་འཕགས་པ་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the attainment of noble absorption.

source: ཐོབ་པ་ལ་མི་དགའ་བ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as freedom from displeasure with respect to the attainment.

source: ཏིང་ངེ་འཛིན་གྱི་ཡན་ལག་འཛིན་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as seizing the branch of absorption.

source: ཏིང་ངེ་འཛིན་རྒྱུན་མི་འཆད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as continuous absorption.

source: ལྟ་ཞིང་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as view and understanding.

source: རྟོག་པ་དང་ལྡན་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as understanding.

source: འདི་དག་ནི་ཏིང་ངེ་འཛིན་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the absorption factor of awakening.

source: དེ་ལ་བཏང་སྙོམས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the equanimity factor of awakening?

source: དགའ་བ་ཅི་སྤངས་ཀྱང་གདུང་བ་མེད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as being free from torments even if enjoyment is relinquished.

source: ལུས་དང་། ངག་བཏང་སྙོམས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as equanimity of body and speech.

source: སེམས་ཅན་གྱིས་དབེན་པ་ལ་མི་གནས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as not remaining in meditative seclusion for the sake of sentient beings.

source: སྒྱུ་མ་ལ་མི་གནས་པ་མི་འདོར་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as neither fixating on nor discarding illusion.

source: སེམས་མ་གཏུགས་ཤིང་ཡིད་བྱུང་བ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as an unblemished and undiscouraged mind.

source: ཆོས་ཐམས་ཅད་ལ་སྐད་ཅིག་པར་རྟོག་ཅིང་དང་དུ་ལེན་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as understanding and accepting the momentary character of all phenomena.

source: འདི་དག་ནི་བཏང་སྙོམས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the equanimity factor of awakening.

source: དེ་ལ་ཡང་དག་པའི་ལྟ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of correct view?

source: འཕགས་པ་ཡང་དག་པའི་ལྟ་བ་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the realization of the noble and correct view.

source: ཁོང་དུ་ཆུད་ནས་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as the comprehension that leads to the absence of defilements.

source: ཁོང་དུ་ཆུད་ནས་རིགས་པ་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as comprehension whereby knowledge is realized.

source: ངེས་པར་བརྟགས་ནས་གཞན་ལ་ཕན་པ་ཐོབ་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as achieving what benefits others based on investigation.

source: མཐའ་ཡས་པ་ལ་དཔྱོད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as infinite discernment.

source: རྣམ་པར་སྨིན་པ་སྡུག་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as delightful karmic ripening.

source: འདི་དག་ནི་ཡང་དག་པའི་ལྟ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of correct view.

source: དེ་ལ་ཡང་དག་པའི་རྟོག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of correct thought?

source: ཡང་དག་པའི་རྟོག་པའི་རྣམ་པར་སྨིན་པར་བྱེད་པ་སྤོང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as relinquishment that ripens correct thought.

source: ཡང་དག་པའི་རྟོག་པ་ལ་མི་དགའ་བ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline is the absence of displeasure with respect to correct thought.

source: རྐྱེན་ཇི་ལྟ་བ་རྣམས་ལ་ས་དང་ས་མ་ཡིན་པ་ཡོངས་སུ་ཤེས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as the comprehension of what does and does not constitute a spiritual level with respect to the various conditions.

source: ཡང་དག་པའི་རྟོག་པ་སྦྱོར་བ་ཐམས་ཅད་ལ་མི་སྟེན་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as nonreliance throughout all applications of correct thought.

source: ཡང་དག་པའི་རྟོག་པའི་དབང་གིས་ཡོངས་སུ་བསྔོས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as dedication by the power of correct thought.

source: འཇིག་རྟེན་པ་དང་འཇིག་རྟེན་ལས་འདས་པ་རྣམས་ལ་ཡང་དག་པ་དང་། ཡང་དག་པ་མ་ཡིན་པར་ཡང་དག་པར་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as the understanding of what is correct or not with respect to mundane and supramundane phenomena.

source: འདི་དག་ནི་ཡང་དག་པའི་རྟོག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of correct thought.

source: དེ་ལ་ཡང་དག་པའི་ངག་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of correct speech?

source: ཚིག་སྐྱོན་མེད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity consists in flawless words.

source: ཚིག་རིགས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline consists in reasonable words.

source: འཕགས་པའི་ཚིག་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience consists in noble words.

source: སོ་སོ་ཡང་དག་པར་རིག་པའི་ཚིག་སྒྲུབ་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence uses words based on correct understanding.

source: འཇིག་རྟེན་པ་མངོན་པར་དགའ་བའི་ཚིག་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration consists in words that delight mundane people.

source: ཚིག་བདེན་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight consists in true words.

source: འདི་དག་ནི་ཡང་དག་པའི་ངག་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of correct speech.

source: དེ་ལ་ཡང་དག་པའི་ལས་ཀྱི་མཐའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of correct conduct?

source: ཡང་དག་པའི་ལས་ཀྱི་མཐའི་འབྲས་བུ་ཡོད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as successful correct conduct.

source: ཡང་དག་པའི་ལས་ཀྱི་མཐའི་བསམ་པ་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as the intended limit of correct conduct.

source: ཡང་དག་པའི་ལས་ཀྱི་མཐའ་ལ་མི་དམིགས་པའི་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as the application of nonapprehension with respect to correct conduct.

source: ཡང་དག་པའི་ལས་ཀྱི་མཐའ་ཐམས་ཅད་དུ་མི་འཇུག་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as universal disengagement with respect to correct conduct.

source: གནས་པ་མེད་པ་ཡོངས་སུ་བཟུང་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as the embracing of nonabiding.

source: ཡང་དག་པའི་ལས་ཀྱི་མཐའ་མ་བརྟགས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as nonanticipation with respect to correct conduct.

source: འདི་དག་ནི་ཡང་དག་པའི་ལས་ཀྱི་མཐའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of correct conduct.

source: དེ་ལ་ཡང་དག་པའི་འཚོ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of correct livelihood?

source: ཡང་དག་པའི་འཚོ་བ་ལ་དགའ་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity is delighting in correct livelihood.

source: མྱ་ངན་ལས་འདས་པས་ཉེ་བར་འཚོ་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as correct livelihood by way of nirvāṇa.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་སྙིང་རྗེ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as compassion that thoroughly ripens sentient beings.

source: ཆོས་རྟོགས་པས་ཉེ་བར་འཚོ་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as being sustained by the realization of the Dharma.

source: སེམས་ཅན་མེད་པས་ཉེ་བར་འཚོ་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as being sustained by the absence of sentient beings.

source: ཟང་ཟིང་མེད་པས་ཉེ་བར་འཚོ་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight is to be sustained by the absence of material goods.

source: འདི་དག་ནི་ཡང་དག་པའི་འཚོ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ །
en: Such are the six perfections of correct livelihood.

source: དེ་ལ་ཡང་དག་པའི་རྩོལ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of correct effort?

source: ཐམས་ཅད་སྤངས་ཏེ་དགོན་པའི་གནས་མི་འདོར་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity is to give up everything but not to abandon the wilderness.

source: ལུས་དང་། ངག་ཡང་དག་པ་ལ་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as correct employment of body and speech.

source: དམིགས་པ་ལ་མི་དམིགས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as the nonapprehension of apprehended objects.

source: གཟུངས་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as the attainment of retention.

source: བརྡ་ལ་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as engagement with symbols.

source: གནོད་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as harmlessness.

source: འདི་དག་ནི་ཡང་དག་པའི་རྩོལ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of correct effort.

source: དེ་ལ་ཡང་དག་པའི་དྲན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of correct mindfulness?

source: འདུས་བྱས་ལ་མི་ལྟ་བའི་དྲན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as mindfulness that has no regard for conditioned phenomena.

source: ཆོས་ཐམས་ཅད་ཀྱི་སྐྱོན་དང་ཡོན་ཏན་འཇལ་བར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as the evaluation of flaws and positive qualities with respect to all phenomena.

source: རྒྱུན་མི་འཆད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as unbroken continuity.

source: བག་ཡོད་པའི་རྣམ་པར་སྨིན་པ་དྲན་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as mindfulness that ripens as carefulness.

source: ཆོས་ཐམས་ཅད་ཀྱི་ཡང་དག་པའི་ཐོབ་པ་ལ་བརྗེད་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as not forgetting the attainment of the reality of all phenomena.

source: ཞི་གནས་བསྒོམ་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as the cultivation of calm abiding.

source: འདི་དག་ནི་ཡང་དག་པའི་དྲན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of correct mindfulness.

source: དེ་ལ་ཡང་དག་པའི་ཏིང་ངེ་འཛིན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of correct absorption?

source: ཡང་དག་པའི་ཏིང་ངེ་འཛིན་ལ་མངོན་པར་དགའ་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as delighting in correct absorption.

source: ཡང་དག་པའི་ཏིང་ངེ་འཛིན་ཤིན་ཏུ་གནས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as abiding within absorption.

source: ཡང་དག་པའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་མོ་རྣམ་པར་གྲོལ་བ་དང་ལྟ་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience consists in the view, liberation, and gateways of absorption.

source: ཡང་དག་པའི་ཏིང་ངེ་འཛིན་མ་གཏུགས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as unblemished absorption.

source: ཡང་དག་པའི་ཏིང་ངེ་འཛིན་ལེགས་པར་འོངས་པ་བསམ་པ་ཇི་ལྟ་བ་བཞིན་ལས་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as the imminent absorption that works exactly as intended.

source: ཡང་དག་པའི་ཏིང་ངེ་འཛིན་གཉེན་པོ་ཡོངས་སུ་གཅོད་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as absorption that determines the remedy.

source: འདི་དག་ནི་ཡང་དག་པའི་ཏིང་ངེ་འཛིན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of correct absorption.

source: གནོད་པར་བྱེད་པའི་ཆོས་རྣམས་སྤོང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity is relinquishing harmful factors.

source: ལུས་དང་། སེམས་ཤིན་ཏུ་སྦྱངས་པ་ལ་དགའ་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as delighting in the ease of body and mind.

source: སྒྲིབ་པ་མེད་པ་ལ་སྙོམས་པར་འཇུག་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as meditative attainment free from obscurations.

source: ཏིང་ངེ་འཛིན་ལ་གཞན་གྱིས་ཉམས་པར་བྱར་མེད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as absorption that is incorruptible by extraneous factors.

source: ཡེ་ཤེས་ཀྱི་སྦྱོར་བ་མ་རྒུད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as not weakening the application of wisdom.

source: བསམ་པ་ཐམས་ཅད་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as the realization of all intents.

source: མ་ཐོས་པར་ཆོས་རྣམས་མངོན་པར་བརྗོད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as expressing the Dharma teachings without having heard them.

source: སྐྱོན་མེད་པར་མངོན་པར་བརྗོད་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as flawless expression.

source: སྐྱེ་བོ་མང་པོ་འདོད་པར་མངོན་པར་བརྗོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as speaking in accordance with the wishes of many people.

source: ལྡེམ་པོ་དག་ཕུན་སུམ་ཚོགས་པར་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as perfect allegories.

source: ཆོས་ཀྱི་ཉིང་མཚམས་སྦྱོར་བ་ཕུན་སུམ་ཚོགས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as perfect connections to the Dharma.

source: ཟིལ་གྱིས་མི་ནོན་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as being indomitable.

source: དེ་ལ་རིག་པ་ལ་དམིགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections focused on knowledge?

source: རིག་པ་ལ་སྦྱོར་བ་གྲུབ་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as accomplishing the application of knowledge.

source: འདོད་པར་འགྱུར་བའི་རིག་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as desirable knowledge.

source: རིག་པ་ཐམས་ཅད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience is universal knowledge.

source: རིག་པའི་ས་ཐམས་ཅད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence comprises all levels of knowledge.
